In [1]:
# Numbeo website contains country name and quality of life index from 2012-2019
# For geojson chloropleth mapping, we need to join the Numbeo table with standard ISO country code
# This python file will scrape Numbeo and ISO websites and merge by standard ISO country code for our geojson world map

In [2]:
# Import dependencies
import pandas as pd
import numpy as np
import json

In [3]:
# Fix Python SSL CERTIFICATE_VERIFY_FAILED
import os, ssl
if (not os.environ.get('PYTHONHTTPSVERIFY', '') and
    getattr(ssl, '_create_unverified_context', None)): 
    ssl._create_default_https_context = ssl._create_unverified_context

In [4]:
# Numbeo has Quality of Life index from years 2012 to 2019
# Create list of links to scrape
# Loop to create URL links from 2012-2018
link=[]
for x in range(2012,2019):
    link.append('https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title='+str(x))
print(link)

['https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2012', 'https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2013', 'https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2014', 'https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2015', 'https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2016', 'https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2017', 'https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2018']

In [5]:
# Append year 2019 URL link
link.append('https://www.numbeo.com/quality-of-life/rankings_by_country.jsp')
print(link)

['https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2012', 'https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2013', 'https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2014', 'https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2015', 'https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2016', 'https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2017', 'https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2018', 'https://www.numbeo.com/quality-of-life/rankings_by_country.jsp']

In [6]:
# Scrape and read as pandas dataframe
for index,element in enumerate(link):
    print(element)

https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2012
https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2013
https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2014
https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2015
https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2016
https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2017
https://www.numbeo.com/quality-of-life/rankings_by_country.jsp?title=2018
https://www.numbeo.com/quality-of-life/rankings_by_country.jsp

In [7]:
# numDf = []
# for index,element in enumerate(link):
#     print(index,element)
#     numDf.append("numDF"+str(index+2012))
#     numDf[index] = pd.read_html("'"+str(element)+"'")

In [8]:
# Read in Numbeo HTML as Pandas table
table = pd.read_html('https://www.numbeo.com/quality-of-life/rankings_by_country.jsp')
numDf2019 = table[2]
numDf2019.head()

,Rank,Country,Quality of Life Index,Purchasing Power Index,Safety Index,Health Care Index,Cost of Living Index,Property Price to Income Ratio,Traffic Commute Time Index,Pollution Index,Climate Index
0,NaN,Denmark,198.57,114.39,75.75,79.41,81.38,6.93,28.51,22.14,81.80
1,NaN,Switzerland,195.93,129.70,78.50,72.68,121.16,9.63,29.05,22.03,80.05
2,NaN,Finland,194.01,112.30,77.20,73.49,72.82,7.98,30.41,11.93,58.56
3,NaN,Australia,191.13,122.85,57.24,76.38,72.08,7.60,35.29,23.97,93.75
4,NaN,Austria,191.05,96.70,78.63,79.19,71.79,10.14,25.15,21.97,77.74

In [9]:
# populate rank starting with 1
numDf2019['Rank'] = [x for x in range(1,len(numDf2019)+1)]
numDf2019.head()

,Rank,Country,Quality of Life Index,Purchasing Power Index,Safety Index,Health Care Index,Cost of Living Index,Property Price to Income Ratio,Traffic Commute Time Index,Pollution Index,Climate Index
0,1,Denmark,198.57,114.39,75.75,79.41,81.38,6.93,28.51,22.14,81.80
1,2,Switzerland,195.93,129.70,78.50,72.68,121.16,9.63,29.05,22.03,80.05
2,3,Finland,194.01,112.30,77.20,73.49,72.82,7.98,30.41,11.93,58.56
3,4,Australia,191.13,122.85,57.24,76.38,72.08,7.60,35.29,23.97,93.75
4,5,Austria,191.05,96.70,78.63,79.19,71.79,10.14,25.15,21.97,77.74

In [10]:
# Read in ISO HTML as Pandas Table
table = pd.read_html('https://www.iban.com/country-codes')
isoDf = table[0]
isoDf.head()

          Country Alpha-2 code Alpha-3 code  Numeric
0     Afghanistan           AF          AFG        4
1   Åland Islands           AX          ALA      248
2         Albania           AL          ALB        8
3         Algeria           DZ          DZA       12
4  American Samoa           AS          ASM       16

In [11]:
# Rename Numbeo columns
numDf2019 = numDf2019.rename(columns={
    'Quality of Life Index':'QII',
    'Purchasing Power Index':'PPI',
    'Safety Index':'SI',
    'Health Care Index':'HI',
    'Cost of Living Index':'CI',
    'Property Price to Income Ratio':'PPIRI',
    'Traffic Commute Time Index':'TCTI',
    'Pollution Index':'PI',
    'Climate Index':'CI'
})
numDf2019.head()

,Rank,Country,QII,PPI,SI,HI,CI,PPIRI,TCTI,PI,CI
0,1,Denmark,198.57,114.39,75.75,79.41,81.38,6.93,28.51,22.14,81.80
1,2,Switzerland,195.93,129.70,78.50,72.68,121.16,9.63,29.05,22.03,80.05
2,3,Finland,194.01,112.30,77.20,73.49,72.82,7.98,30.41,11.93,58.56
3,4,Australia,191.13,122.85,57.24,76.38,72.08,7.60,35.29,23.97,93.75
4,5,Austria,191.05,96.70,78.63,79.19,71.79,10.14,25.15,21.97,77.74

In [12]:
# Rename ISO columns
isoDf = isoDf.rename(columns={
    'Alpha-2 code':'iso_a2',
    'Alpha-3 code':'iso_a3',
    'Numeric':'iso_n'
})
isoDf.head()

          Country iso_a2 iso_a3  iso_n
0     Afghanistan     AF    AFG      4
1   Åland Islands     AX    ALA    248
2         Albania     AL    ALB      8
3         Algeria     DZ    DZA     12
4  American Samoa     AS    ASM     16

In [13]:
# Left Join Numbeo and ISO by Country
countryDf = numDf2019.merge(isoDf, on='Country', how='left')
countryDf.head()

,Rank,Country,QII,PPI,SI,HI,CI,PPIRI,TCTI,PI,CI,iso_a2,iso_a3,iso_n
0,1,Denmark,198.57,114.39,75.75,79.41,81.38,6.93,28.51,22.14,81.80,DK,DNK,208.0
1,2,Switzerland,195.93,129.70,78.50,72.68,121.16,9.63,29.05,22.03,80.05,CH,CHE,756.0
2,3,Finland,194.01,112.30,77.20,73.49,72.82,7.98,30.41,11.93,58.56,FI,FIN,246.0
3,4,Australia,191.13,122.85,57.24,76.38,72.08,7.60,35.29,23.97,93.75,AU,AUS,36.0
4,5,Austria,191.05,96.70,78.63,79.19,71.79,10.14,25.15,21.97,77.74,AT,AUT,40.0

In [14]:
# Check for null columns
null_columns = countryDf.columns[countryDf.isnull().any()]
countryDf[null_columns].isnull().sum()

iso_a2    13
iso_a3    13
iso_n     13
dtype: int64

In [15]:
# Find 13 countries that did not match in the join
countryDf[countryDf.iso_a2.isnull()].Country

5                Netherlands
12             United States
16            United Kingdom
19      United Arab Emirates
24            Czech Republic
32               South Korea
41                    Taiwan
44    Bosnia And Herzegovina
55                 Macedonia
58                    Russia
66               Philippines
67                   Vietnam
69                      Iran
Name: Country, dtype: object

In [16]:
# Clean each country one by one
# Match as Numbeo country

# Netherlands
isoDf[isoDf['Country'].str.contains('Neth', case=False)]

               Country iso_a2 iso_a3  iso_n
157  Netherlands (the)     NL    NLD    528

In [17]:
isoDf.loc[isoDf['Country'].str.contains('Neth', case=False), 'Country'] = 'Netherlands'
isoDf[isoDf['Country'].str.contains('Neth', case=False)]

         Country iso_a2 iso_a3  iso_n
157  Netherlands     NL    NLD    528

In [18]:
# United States and United Kingdom and United Arab Emirates
isoDf[isoDf['Country'].str.contains('United', case=False)]

                                               Country iso_a2 iso_a3  iso_n
219                       Tanzania, United Republic of     TZ    TZA    834
233                         United Arab Emirates (the)     AE    ARE    784
234  United Kingdom of Great Britain and Northern I...     GB    GBR    826
235         United States Minor Outlying Islands (the)     UM    UMI    581
236                     United States of America (the)     US    USA    840

In [19]:
isoDf.loc[isoDf['Country'].str.contains('United States of America', case=False), 'Country'] = 'United States'
isoDf.loc[isoDf['Country'].str.contains('United Kingdom of Great Britain', case=False), 'Country'] = 'United Kingdom'
isoDf.loc[isoDf['Country'].str.contains('United Arab Emirates', case=False), 'Country'] = 'United Arab Emirates'
isoDf[isoDf['Country'].str.contains('United', case=False)]

                                        Country iso_a2 iso_a3  iso_n
219                Tanzania, United Republic of     TZ    TZA    834
233                        United Arab Emirates     AE    ARE    784
234                              United Kingdom     GB    GBR    826
235  United States Minor Outlying Islands (the)     UM    UMI    581
236                               United States     US    USA    840

In [20]:
# Czech Republic
isoDf[isoDf['Country'].str.contains('Czech', case=False)]

    Country iso_a2 iso_a3  iso_n
59  Czechia     CZ    CZE    203

In [21]:
isoDf.loc[isoDf['Country'].str.contains('Czech', case=False), 'Country'] = 'Czech Republic'
isoDf[isoDf['Country'].str.contains('Czech', case=False)]

           Country iso_a2 iso_a3  iso_n
59  Czech Republic     CZ    CZE    203

In [22]:
# South Korea
isoDf[isoDf['Country'].str.contains('Korea', case=False)]

                                         Country iso_a2 iso_a3  iso_n
118  Korea (the Democratic People's Republic of)     KP    PRK    408
119                      Korea (the Republic of)     KR    KOR    410

In [23]:
isoDf.loc[isoDf['Country']=='Korea (the Republic of)', 'Country'] = 'South Korea'
isoDf[isoDf['Country'].str.contains('Korea', case=False)]

                                         Country iso_a2 iso_a3  iso_n
118  Korea (the Democratic People's Republic of)     KP    PRK    408
119                                  South Korea     KR    KOR    410

In [24]:
# Taiwan
isoDf[isoDf['Country'].str.contains('Taiwan', case=False)]

                        Country iso_a2 iso_a3  iso_n
217  Taiwan (Province of China)     TW    TWN    158

In [25]:
isoDf.loc[isoDf['Country']=='Taiwan (Province of China)', 'Country'] = 'Taiwan'
isoDf[isoDf['Country'].str.contains('Taiwan', case=False)]

    Country iso_a2 iso_a3  iso_n
217  Taiwan     TW    TWN    158

In [26]:
# Bosnia And Herzegovina
isoDf[isoDf['Country'].str.contains('Bosnia', case=False)]

                   Country iso_a2 iso_a3  iso_n
28  Bosnia and Herzegovina     BA    BIH     70

In [27]:
isoDf.loc[isoDf['Country']=='Bosnia and Herzegovina', 'Country'] = 'Bosnia And Herzegovina'
isoDf[isoDf['Country'].str.contains('Bosnia', case=False)]

                   Country iso_a2 iso_a3  iso_n
28  Bosnia And Herzegovina     BA    BIH     70

In [28]:
# Macedonia
isoDf[isoDf['Country'].str.contains('Macedonia', case=False)]

                                         Country iso_a2 iso_a3  iso_n
132  Macedonia (the former Yugoslav Republic of)     MK    MKD    807

In [29]:
isoDf.loc[isoDf['Country']=='Macedonia (the former Yugoslav Republic of)', 'Country'] = 'Macedonia'
isoDf[isoDf['Country'].str.contains('Macedonia', case=False)]

       Country iso_a2 iso_a3  iso_n
132  Macedonia     MK    MKD    807

In [30]:
# Russia
isoDf[isoDf['Country'].str.contains('Russia', case=False)]

                      Country iso_a2 iso_a3  iso_n
183  Russian Federation (the)     RU    RUS    643

In [31]:
isoDf.loc[isoDf['Country']=='Russian Federation (the)', 'Country'] = 'Russia'
isoDf[isoDf['Country'].str.contains('Russia', case=False)]

    Country iso_a2 iso_a3  iso_n
183  Russia     RU    RUS    643

In [32]:
# Philippines
isoDf[isoDf['Country'].str.contains('Philippines', case=False)]

               Country iso_a2 iso_a3  iso_n
175  Philippines (the)     PH    PHL    608

In [33]:
isoDf.loc[isoDf['Country']=='Philippines (the)', 'Country'] = 'Philippines'
isoDf[isoDf['Country'].str.contains('Philippines', case=False)]

         Country iso_a2 iso_a3  iso_n
175  Philippines     PH    PHL    608

In [34]:
# Vietnam
isoDf[isoDf['Country'].str.contains('Viet', case=False)]

      Country iso_a2 iso_a3  iso_n
241  Viet Nam     VN    VNM    704

In [35]:
isoDf.loc[isoDf['Country']=='Viet Nam', 'Country'] = 'Vietnam'
isoDf[isoDf['Country'].str.contains('Vietnam', case=False)]

     Country iso_a2 iso_a3  iso_n
241  Vietnam     VN    VNM    704

In [36]:
# Iran
isoDf[isoDf['Country'].str.contains('Iran', case=False)]

                        Country iso_a2 iso_a3  iso_n
105  Iran (Islamic Republic of)     IR    IRN    364

In [37]:
isoDf.loc[isoDf['Country']=='Iran (Islamic Republic of)', 'Country'] = 'Iran'
isoDf[isoDf['Country'].str.contains('Iran', case=False)]

    Country iso_a2 iso_a3  iso_n
105    Iran     IR    IRN    364

In [38]:
# With Clean Data: Left Join Numbeo and ISO by Country
countryDf = numDf2019.merge(isoDf, on='Country', how='left')
countryDf.head()

,Rank,Country,QII,PPI,SI,HI,CI,PPIRI,TCTI,PI,CI,iso_a2,iso_a3,iso_n
0,1,Denmark,198.57,114.39,75.75,79.41,81.38,6.93,28.51,22.14,81.80,DK,DNK,208
1,2,Switzerland,195.93,129.70,78.50,72.68,121.16,9.63,29.05,22.03,80.05,CH,CHE,756
2,3,Finland,194.01,112.30,77.20,73.49,72.82,7.98,30.41,11.93,58.56,FI,FIN,246
3,4,Australia,191.13,122.85,57.24,76.38,72.08,7.60,35.29,23.97,93.75,AU,AUS,36
4,5,Austria,191.05,96.70,78.63,79.19,71.79,10.14,25.15,21.97,77.74,AT,AUT,40

In [39]:
# Check for null columns
null_columns = countryDf.columns[countryDf.isnull().any()]
countryDf[null_columns].isnull().sum()

Series([], dtype: float64)

In [40]:
# Final table 2019
countryDf.head()

,Rank,Country,QII,PPI,SI,HI,CI,PPIRI,TCTI,PI,CI,iso_a2,iso_a3,iso_n
0,1,Denmark,198.57,114.39,75.75,79.41,81.38,6.93,28.51,22.14,81.80,DK,DNK,208
1,2,Switzerland,195.93,129.70,78.50,72.68,121.16,9.63,29.05,22.03,80.05,CH,CHE,756
2,3,Finland,194.01,112.30,77.20,73.49,72.82,7.98,30.41,11.93,58.56,FI,FIN,246
3,4,Australia,191.13,122.85,57.24,76.38,72.08,7.60,35.29,23.97,93.75,AU,AUS,36
4,5,Austria,191.05,96.70,78.63,79.19,71.79,10.14,25.15,21.97,77.74,AT,AUT,40

In [41]:
countryDf=countryDf.rename(columns={"iso_a3":"ISO_A3"})

In [66]:
dfk=pd.read_json("countries.geojson")
dfk=dfk.drop(["type"],axis =1)
dfk.head()

                                            features
0  {'type': 'Feature', 'properties': {'ADMIN': 'A...
1  {'type': 'Feature', 'properties': {'ADMIN': 'A...
2  {'type': 'Feature', 'properties': {'ADMIN': 'A...
3  {'type': 'Feature', 'properties': {'ADMIN': 'A...
4  {'type': 'Feature', 'properties': {'ADMIN': 'A...

In [43]:
dfk.to_json("check.json", orient='index')

In [44]:
countryDf.iloc[0]

Rank             1
Country    Denmark
QII         198.57
PPI         114.39
SI           75.75
HI           79.41
CI           81.38
PPIRI         6.93
TCTI         28.51
PI           22.14
CI            81.8
iso_a2          DK
ISO_A3         DNK
iso_n          208
Name: 0, dtype: object

In [45]:
dfk.tail()

                                              features
250  {'type': 'Feature', 'properties': {'ADMIN': 'S...
251  {'type': 'Feature', 'properties': {'ADMIN': 'Y...
252  {'type': 'Feature', 'properties': {'ADMIN': 'S...
253  {'type': 'Feature', 'properties': {'ADMIN': 'Z...
254  {'type': 'Feature', 'properties': {'ADMIN': 'Z...

In [46]:
len(dfk)

255

In [47]:
dict={"type":"FeatureCollection","features":[]}
for x in range(len(dfk)):
    dict["features"].append(dfk.features[x])

In [48]:
r=json.dumps(dict)

In [49]:
with open('result.json', 'w') as fp:
    json.dump(dict, fp)

In [50]:
type(dict["features"][0]["properties"]["ADMIN"])

str

In [51]:
for x in range(len(dfk)-1,-1,-1):
    if dict["features"][x]["properties"]["ISO_A3"] not in countryDf["ISO_A3"].values:
        dict["features"].pop(x)

In [52]:
len(dict["features"])

71

In [53]:
cdf=countryDf.sort_values(by=['ISO_A3'])
cdf=cdf.reset_index(drop=True)
cdf.tail()

,Rank,Country,QII,PPI,SI,HI,CI,PPIRI,TCTI,PI,CI,iso_a2,ISO_A3,iso_n
66,42,Taiwan,133.82,56.36,82.62,86.22,59.84,28.91,30.90,63.47,84.38,TW,TWN,158
67,62,Ukraine,102.34,32.72,51.12,50.95,27.94,14.35,37.36,66.63,70.69,UA,UKR,804
68,13,United States,179.20,122.03,52.87,69.41,69.91,3.58,32.87,33.95,77.51,US,USA,840
69,68,Vietnam,88.82,33.33,51.22,54.54,37.70,19.66,28.33,87.13,71.24,VN,VNM,704
70,40,South Africa,135.31,82.97,23.20,62.56,42.49,4.11,40.33,56.95,95.97,ZA,ZAF,710

In [55]:
for x in range(len(dict["features"])):
    temp=cdf.loc[x]
    tempdf=pd.DataFrame(temp).T
    tempdict=tempdf.to_dict("records")
    dict["features"][x]["properties"].update(tempdict[0])

C:\Users\Administrator\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: UserWarning: DataFrame columns are not unique, some columns will be omitted.
  after removing the cwd from sys.path.

In [56]:
type(dict["features"][0]["properties"])

dict

In [ ]:
k=cdf.loc[0]
kk=pd.DataFrame(k).T
kkk=kk.to_dict('records')

In [ ]:
kkk[0]

In [ ]:
countryDf["ISO_A3"].tail()

In [ ]:
aa={"one":1,"two":2}
bb={"three":3, "five":5}

In [63]:
dict["features"][48]["properties"]

{'ADMIN': 'Norway',
 'ISO_A3': 'NOR',
 'Rank': 10,
 'Country': 'Norway',
 'QII': 181.86,
 'PPI': 103.61,
 'SI': 64.68,
 'HI': 74.14,
 'CI': 71.16,
 'PPIRI': 8.4,
 'TCTI': 27.12,
 'PI': 19.86,
 'iso_a2': 'NO',
 'iso_n': 578}

In [61]:
r=json.dumps(dict)

In [62]:
with open('result.json', 'w') as fp:
    json.dump(dict, fp)

In [65]:
countryDf.head()

,Rank,Country,QII,PPI,SI,HI,CI,PPIRI,TCTI,PI,CI,iso_a2,ISO_A3,iso_n
0,1,Denmark,198.57,114.39,75.75,79.41,81.38,6.93,28.51,22.14,81.80,DK,DNK,208
1,2,Switzerland,195.93,129.70,78.50,72.68,121.16,9.63,29.05,22.03,80.05,CH,CHE,756
2,3,Finland,194.01,112.30,77.20,73.49,72.82,7.98,30.41,11.93,58.56,FI,FIN,246
3,4,Australia,191.13,122.85,57.24,76.38,72.08,7.60,35.29,23.97,93.75,AU,AUS,36
4,5,Austria,191.05,96.70,78.63,79.19,71.79,10.14,25.15,21.97,77.74,AT,AUT,40